backend/controllers/CategoryController.php

    public function actionCreate()
    {
        $model = new Category();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `category` (`name`) VALUES ('2')

    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {
---
SELECT * FROM `category` WHERE `id`='1'