backend/controllers/CommentController.php

SELECT * FROM `comment` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Comment::findOne($id)) !== null) {