backend/controllers/PostController.php

    public function actionCreate()
    {
        $model = new Post();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `post` (`name`, `content`, `category_id`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES ('D', 'D', 2, 1474277009, 1474277009, 1, 1)

    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {
---
SELECT * FROM `post` WHERE `id`='2'