backend/controllers/UserController.php

SELECT * FROM `user` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {