frontend/controllers/SiteController.php

    public function actionIndex($cat = null)
    {
		if(!$cat) $query=Post::find();
		else $query=Post::find()->where(['category_id' => $cat]);
		$count = $query->count();
		$pagination = new Pagination(['totalCount' => $count, 'pageSize' => 5]);
		$posts = $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT COUNT(*) FROM `post`
SELECT * FROM `post` LIMIT 5 OFFSET 5

	public function actionPost($id)
	{
		$model = new Comment();
		$post = Post::find()->where(['id' => $id])->one();
---
SELECT * FROM `post` WHERE `id`='2'