backend/views/user/view.php

SELECT * FROM `auth_assignment` WHERE `user_id`=1
---
        ],
    ]) ?>

	Uprawnienia: <?= AuthAssignment::find()->where(['user_id' => $model->id])->one()->item_name ?>