backend/views/post/_form.php


    <?= $form->field($model, 'content')->textarea(['rows' => 6]) ?>

	<?= $form->field($model, 'category_id')->dropDownList(ArrayHelper::map(Category::find()->all(), 'id', 'name')); ?>
---
SELECT * FROM `category`