frontend/views/site/cats.php

SELECT * FROM `category`
---
use common\models\Category;
?>
<div class="list-group">
  <?php foreach(Category::find()->all() as $cat): ?>