frontend/views/site/index.php

SELECT * FROM `user` WHERE `id`=1
---
<div id="post">
<h1><a href="<?= Url::to(['site/post', 'id' => $post->id]) ?>"><?= $post->name ?></a></h1>
<h4><?= $post->content ?></h4>
<?= User::find()->where(['id' => $post->created_by])->one()->username ?> - <?= date('d/m/Y H:i:s', $post->created_at) ?> - <?= $post->category->name ?>