frontend/views/site/post.php

<div id="post">
<h1><a href="<?= Url::to(['site/post', 'id' => $post->id]) ?>"><?= $post->name ?></a></h1>
<h4><?= $post->content ?></h4>
<?= User::find()->where(['id' => $post->created_by])->one()->username ?> - <?= date('d/m/Y H:i:s', $post->created_at) ?><?php if (\Yii::$app->user->can('createPost')): ?> - <b><a href="<?= Yii::$app->urlManagerBackend->createAbsoluteUrl('index.php?r=post%2Fview&id=') ?><?= $post->id ?>">Zarządzaj postem</a></b><?php endif; ?>
---
SELECT * FROM `user` WHERE `id`=1

<hr>
<div id="comments">
<div class="panel-group">
<?php foreach(Comment::find()->where(['post_id' => $post->id])->all() as $comment): ?>
<div class="panel panel-primary">
<div class="panel-heading"><?= User::find()->where(['id' => $comment->created_by])->one()->username ?></div>
---
SELECT * FROM `comment` WHERE `post_id`=2
SELECT * FROM `user` WHERE `id`=1